# StructuralSectionIshapeWebheight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIshapeWebheight Property
ParameterTypeId Class See Also
---
"Web Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIshapeWebheight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIshapeWebheight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIshapeWebheight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace